---
type: SpaceSetIterator
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 4
tags: [revit-api, class]
---

# SpaceSetIterator

`Autodesk.Revit.DB.Mechanical.SpaceSetIterator` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SpaceSetIterator | — | `public SpaceSetIterator ()` |
| Method | MoveNext | — | `public virtual bool MoveNext ()` |
| Method | Reset | — | `public virtual void Reset ()` |
| Property | Current | — | `public virtual Object Current { get ; }` |